imagemagick.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-28 Wed 12:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>imagemagick</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">imagemagick</h1>
<p>
imagemagick is a command-line image manipulation tool.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. precedence</a></li>
<li><a href="#org0000001">2. colors</a>
<ul>
<li><a href="#org0000002">2.1. invert colors</a></li>
<li><a href="#org0000003">2.2. convert colors to monochrome</a></li>
<li><a href="#org0000004">2.3. convert to grayscale</a></li>
<li><a href="#org0000005">2.4. remove alpha</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> precedence</h2>
<div class="outline-text-2" id="text-1">
<p>
options are done in order, so an option needs to be before other
options to effect them. for example to turn off dithering with
<code>+dither</code>, you have to put that before other things that would use
dithering.
</p>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> colors</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0000002" class="outline-3">
<h3 id="org0000002"><span class="section-number-3">2.1.</span> invert colors</h3>
<div class="outline-text-3" id="text-2-1">
<p>
use the <code>-negate</code> option
</p>
</div>
</div>

<div id="outline-container-org0000003" class="outline-3">
<h3 id="org0000003"><span class="section-number-3">2.2.</span> convert colors to monochrome</h3>
<div class="outline-text-3" id="text-2-2">
<p>
use the <code>-monochrome</code> option
</p>
</div>
</div>

<div id="outline-container-org0000004" class="outline-3">
<h3 id="org0000004"><span class="section-number-3">2.3.</span> convert to grayscale</h3>
<div class="outline-text-3" id="text-2-3">
<p>
use <code>-colorspace gray</code>.
</p>

<p>
you can limit the number of colors with <code>-colors</code> and turn off
dithering with <code>+dither</code>, though this seems to really highlight
artifacts if using jpeg.
</p>

<p>
occationally, especially if you only have a few colors, this can
actually produce larger file sizes than just normal indexed colors. if
using PNG, you can prefix the filename with <code>PNG8:</code> to force a normal
colorspace which can then be indexed using something like <a href="./pngo.html">pngo</a>. do
check the size though, this can also make the size much larger.
</p>
</div>
</div>

<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">2.4.</span> remove alpha</h3>
<div class="outline-text-3" id="text-2-4">
<p>
use the <code>-flatten</code> option for this. you can also set the <code>-background
color</code> to a color beforehand if you want to replace the alpha with a
specific color.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
